DataProcessors/ЗапускЭтапаПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ЗапускЭтапаПроцесса</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНовогоЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйЭтап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительЭтапаСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание постановки задачи для исполнителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРеквизитаОсновногоОбъектаАдресации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРеквизитаДополнительногоОбъектаАдресации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Предмет</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПредметПроцессаОбработкиДокументов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НастройкаИспользованияШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкаИспользованияШаблонов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УсловиеИспользования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПроцессов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТекущиеСтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеСтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаПоОбработкеДокумента</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцессаОбработкиДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЗапускЭтапаПроцесса/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроцессыОбработкиДокументов.ЗаполнитьСписокДоступныхИдентификаторов(СписокДоступныхИдентификаторов);
	
	Элементы.ИдентификаторДокумента.ПараметрыВыбора = Новый ФиксированныйМассив(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Новый ПараметрВыбора("Отбор.Ссылка", СписокДоступныхИдентификаторов)));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ВыборЭтапаПроцесса" Тогда
		Если ВыбранноеЗначение <> Неопределено Тогда
			Объект.НовыйЭтап = ВыбранноеЗначение.Этап;
			Объект.ИдентификаторНовогоЭтапа = ВыбранноеЗначение.ИдентификаторЭтапа;
			ПредставлениеЭтапа = Строка(ВыбранноеЗначение.НомерЭтапа)+". "+ВыбранноеЗначение.Этап;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИдентификаторДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПроцессыОбработкиДокументовКлиент.ОткрытьФормуВыбораТипаДокумента(
		Элемент, ДанныеВыбора, СтандартнаяОбработка,
		Новый Структура("ТекущаяСтрока", Объект.ИдентификаторДокумента), СписокДоступныхИдентификаторов);
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторДокументаПриИзменении(Элемент)
	
	ПриИзмененииИдентификатораДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторДокументаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.СписокДокументов.Количество() > 0
		И ВыбранноеЗначение <> Объект.ИдентификаторДокумента Тогда
		ТекстВопроса = НСтр("ru = 'При изменении вида документа табличная часть будет очищена'");
		Обработчик = Новый ОписаниеОповещения("ПродолжитьВыборВидаДокументаПослеПодтвержденияОчисткиТЧ", ЭтотОбъект, ВыбранноеЗначение);
		ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйЭтапНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", 			НСтр("ru = 'Выбор этапа процесса для запуска'"));
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", 	Истина);
	ПараметрыФормы.Вставить("Шаблон", 				Объект.Шаблон);
	ПараметрыФормы.Вставить("ИдентификаторЭтапа",	Объект.ИдентификаторНовогоЭтапа);
	
	ОткрытьФорму("ОбщаяФорма.ВыборЭтапаПроцесса", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйЭтапОчистка(Элемент, СтандартнаяОбработка)
	Объект.НовыйЭтап = "";
	Объект.ИдентификаторНовогоЭтапа = "";
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПроцессыОбработкиДокументовКлиент.ВыбратьИсполнителя(Элемент, Объект.Исполнитель, , Истина, , Объект.ИдентификаторДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Объект.Исполнитель = ВыбранноеЗначение.РольИсполнителя;
		Объект.ОсновнойОбъектАдресации = ВыбранноеЗначение.ОсновнойОбъектАдресации;
		Объект.ДополнительныйОбъектАдресации = ВыбранноеЗначение.ДополнительныйОбъектАдресации;
		Объект.ИмяРеквизитаОсновногоОбъектаАдресации = ВыбранноеЗначение.ИмяРеквизитаОсновногоОбъектаАдресации;
		Объект.ИмяРеквизитаДополнительногоОбъектаАдресации = ВыбранноеЗначение.ИмяРеквизитаДополнительногоОбъектаАдресации;
	Иначе
		Объект.Исполнитель = ВыбранноеЗначение;
	КонецЕсли;
	
	Объект.ИсполнительЭтапаСтрокой = ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеИсполнителяЭтапа(
		Объект.Исполнитель,
		Объект.ОсновнойОбъектАдресации,
		Объект.ДополнительныйОбъектАдресации,
		Объект.ИмяРеквизитаОсновногоОбъектаАдресации,
		Объект.ИмяРеквизитаДополнительногоОбъектаАдресации);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительОчистка(Элемент, СтандартнаяОбработка)
	Объект.ОсновнойОбъектАдресации = "";
	Объект.ДополнительныйОбъектАдресации = "";
	Объект.ИмяРеквизитаОсновногоОбъектаАдресации = "";
	Объект.ИмяРеквизитаДополнительногоОбъектаАдресации = "";
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,Объект.Исполнитель);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭтапыШаблона

&НаКлиенте
Процедура СписокДокументовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Для Каждого Документ Из ВыбранноеЗначение Цикл
		НайденныеДубли = Объект.СписокДокументов.НайтиСтроки(Новый Структура("Предмет", Документ));
		Если НайденныеДубли.Количество() > 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Документ %1 уже присутствует в таблице (строка номер %2).'"),
				Документ,
				НайденныеДубли[0].НомерСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Объект.СписокДокументов.Добавить();
		НоваяСтрока.Предмет = Документ;
		СписокДокументовДокументПриИзмененииНаСервере(
			НоваяСтрока.Предмет,
			НоваяСтрока.ТекущийСтатус,
			НоваяСтрока.НеЗавершеноЗадач);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(Объект.ИдентификаторДокумента) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбран тип документа'"), , "Объект.ИдентификаторДокумента");
		Возврат;
	КонецЕсли;
	
	ИмяФормыВыбора = ИмяФормыВыбораДокумента(Объект.ИдентификаторДокумента);

	ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
	ОткрытьФорму(ПолноеИмя + ИмяФормыВыбора, ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовДокументОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекДанные = Элементы.СписокДокументов.ТекущиеДанные;
	НайденныеДубли = Объект.СписокДокументов.НайтиСтроки(Новый Структура("Предмет", ВыбранноеЗначение));
	Если НайденныеДубли.Количество() > 0 И НайденныеДубли[0].НомерСтроки <> ТекДанные.НомерСтроки Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Документ %1 уже присутствует в таблице (строка номер %2).'"),
			ВыбранноеЗначение,
			НайденныеДубли[0].НомерСтроки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовДокументПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокДокументов.ТекущиеДанные;
	
	СписокДокументовДокументПриИзмененииНаСервере(
		ТекущиеДанные.Предмет,
		ТекущиеДанные.ТекущийСтатус,
		ТекущиеДанные.НеЗавершеноЗадач);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапуститьЭтап(Команда)
	
	Если Объект.СписокДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.НовыйЭтап) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не выбран этап для запуска'"), , "ПредставлениеЭтапа");
		Возврат;
	КонецЕсли;
	Для Каждого СтрокаДокумент Из Объект.СписокДокументов Цикл
		Если СтрокаДокумент.НеЗавершеноЗадач > 0 Тогда
			ТекстВопроса = 
				НСтр("ru = 'В таблице присутствуют документы, по которым есть незавершенные задачи.
					|При старте нового этапа эти задачи будут принудительно прекращены.'");
			Обработчик = Новый ОписаниеОповещения("ПродолжитьВыполнениеКомандыПослеПодтвержденияЗапуска", ЭтотОбъект);
			ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ЗапуститьЭтапНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Подобрать(Команда)
	Если Не ЗначениеЗаполнено(Объект.ИдентификаторДокумента) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбран тип документа'"), , "Объект.ИдентификаторДокумента");
		Возврат;
	КонецЕсли;
	
	ИмяФормыВыбора = ИмяФормыВыбораДокумента(Объект.ИдентификаторДокумента);

	ПараметрыФормы = Новый Структура("РежимВыбора, МножественныйВыбор", Истина, Истина);
    ОткрытьФорму(ПолноеИмя + ИмяФормыВыбора, ПараметрыФормы, Элементы.СписокДокументов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииИдентификатораДокумента()
	
	Объект.НовыйСтатус = "";
	Объект.НовыйЭтап = "";
	Объект.ИдентификаторНовогоЭтапа = "";
	Объект.Исполнитель = "";
	Объект.ОсновнойОбъектАдресации = "";
	Объект.ДополнительныйОбъектАдресации = "";
	Объект.ИмяРеквизитаОсновногоОбъектаАдресации = "";
	Объект.ИмяРеквизитаДополнительногоОбъектаАдресации = "";
	
	ПредставлениеЭтапа = "";
	
	Данные = ДанныеПоИдентификаторуДокумента(Объект.ИдентификаторДокумента);
	
	ПолноеИмя = Данные.ПолноеИмя;
	Если Данные.Свойство("Шаблон") Тогда
		Объект.Шаблон = Данные.Шаблон;
		Объект.НовыйСтатус = Данные.Статус;
		Объект.НовыйЭтап = Данные.Этап;
		Объект.ИдентификаторНовогоЭтапа = Данные.ИдентификаторЭтапа;
		Объект.Исполнитель = Данные.Исполнитель;
		Объект.ОсновнойОбъектАдресации = Данные.ОсновнойОбъектАдресации;
		Объект.ДополнительныйОбъектАдресации = Данные.ДополнительныйОбъектАдресации;
		Объект.ИмяРеквизитаОсновногоОбъектаАдресации = Данные.ИмяРеквизитаОсновногоОбъектаАдресации;
		Объект.ИмяРеквизитаДополнительногоОбъектаАдресации = Данные.ИмяРеквизитаДополнительногоОбъектаАдресации;
		Объект.ИсполнительЭтапаСтрокой = ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеИсполнителяЭтапа(
			Объект.Исполнитель,
			Объект.ОсновнойОбъектАдресации,
			Объект.ДополнительныйОбъектАдресации,
			Объект.ИмяРеквизитаОсновногоОбъектаАдресации,
			Объект.ИмяРеквизитаДополнительногоОбъектаАдресации);
		ПредставлениеЭтапа = Строка(Данные.НомерЭтапа)+". "+Данные.Этап;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеПоИдентификаторуДокумента(ИдентификаторДокумента)
	
	Данные = Новый Структура;
	Данные.Вставить("ПолноеИмя",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИдентификаторДокумента,"ПолноеИмя"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкаИспользованияШаблонов.Шаблон КАК Шаблон,
	|	ШаблоныПроцессов.НачальныйСтатус КАК Статус,
	|	ШаблоныПроцессовЭтапы.НомерСтроки КАК НомерЭтапа,
	|	ШаблоныПроцессовЭтапы.Этап КАК Этап,
	|	ШаблоныПроцессовЭтапы.ИдентификаторЭтапа КАК ИдентификаторЭтапа,
	|	ШаблоныПроцессовЭтапы.Исполнитель КАК Исполнитель,
	|	ШаблоныПроцессовЭтапы.ОсновнойОбъектАдресации КАК ОсновнойОбъектАдресации,
	|	ШаблоныПроцессовЭтапы.ДополнительныйОбъектАдресации КАК ДополнительныйОбъектАдресации,
	|	ШаблоныПроцессовЭтапы.ИмяРеквизитаОсновногоОбъектаАдресации КАК ИмяРеквизитаОсновногоОбъектаАдресации,
	|	ШаблоныПроцессовЭтапы.ИмяРеквизитаДополнительногоОбъектаАдресации КАК ИмяРеквизитаДополнительногоОбъектаАдресации
	|ИЗ
	|	РегистрСведений.НастройкаИспользованияШаблонов КАК НастройкаИспользованияШаблонов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШаблоныПроцессов КАК ШаблоныПроцессов
	|		ПО НастройкаИспользованияШаблонов.Шаблон = ШаблоныПроцессов.Ссылка
	|			И НастройкаИспользованияШаблонов.ИдентификаторДокумента = ШаблоныПроцессов.ИдентификаторДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
	|		ПО НастройкаИспользованияШаблонов.Шаблон = ШаблоныПроцессовЭтапы.Ссылка
	|			И (ШаблоныПроцессовЭтапы.ПредшественникиВариантИспользования ПОДОБНО ""Старт,%"")
	|ГДЕ
	|	НастройкаИспользованияШаблонов.ИдентификаторДокумента = &ИдентификаторДокумента";
	Запрос.УстановитьПараметр("ИдентификаторДокумента",ИдентификаторДокумента);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Данные.Вставить("Шаблон", Выборка.Шаблон);
		Данные.Вставить("Статус", Выборка.Статус);
		Данные.Вставить("НомерЭтапа", Выборка.НомерЭтапа);
		Данные.Вставить("Этап", Выборка.Этап);
		Данные.Вставить("ИдентификаторЭтапа", Выборка.ИдентификаторЭтапа);
		Данные.Вставить("Исполнитель", Выборка.Исполнитель);
		Данные.Вставить("ОсновнойОбъектАдресации", Выборка.ОсновнойОбъектАдресации);
		Данные.Вставить("ДополнительныйОбъектАдресации", Выборка.ДополнительныйОбъектАдресации);
		Данные.Вставить("ИмяРеквизитаОсновногоОбъектаАдресации", Выборка.ИмяРеквизитаОсновногоОбъектаАдресации);
		Данные.Вставить("ИмяРеквизитаДополнительногоОбъектаАдресации", Выборка.ИмяРеквизитаДополнительногоОбъектаАдресации);
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СписокДокументовДокументПриИзмененииНаСервере(ДокументСсылка, Статус, НеЗавершеноЗадач)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТекущиеСтатусыДокументов.Статус КАК Статус,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗадачаПоОбработкеДокумента.Ссылка) КАК НеЗавершеноЗадач
	|ИЗ
	|	РегистрСведений.ТекущиеСтатусыДокументов КАК ТекущиеСтатусыДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачаПоОбработкеДокумента КАК ЗадачаПоОбработкеДокумента
	|		ПО (ЗадачаПоОбработкеДокумента.Предмет = ТекущиеСтатусыДокументов.Предмет)
	|			И (НЕ ЗадачаПоОбработкеДокумента.Выполнена)
	|ГДЕ
	|	ТекущиеСтатусыДокументов.Предмет = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТекущиеСтатусыДокументов.Статус";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Статус = Выборка.Статус;
		НеЗавершеноЗадач = Выборка.НеЗавершеноЗадач;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВыполнениеКомандыПослеПодтвержденияЗапуска(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		
		ЗапуститьЭтапНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьЭтапНаКлиенте()
	
	ЗапуститьЭтапНаСервере();
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Запущен этап ""%1"" для %2 документов(а)'"),
						Объект.НовыйЭтап,
						Объект.СписокДокументов.Количество());
	ПоказатьОповещениеПользователя(,,ТекстСообщения,БиблиотекаКартинок.Информация32);
	
	Объект.СписокДокументов.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьЭтапНаСервере()
	
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗадачаПоОбработкеДокумента.Ссылка КАК Ссылка,
		|	ЗадачаПоОбработкеДокумента.Предмет КАК Документ
		|ИЗ
		|	Задача.ЗадачаПоОбработкеДокумента КАК ЗадачаПоОбработкеДокумента
		|ГДЕ
		|	НЕ ЗадачаПоОбработкеДокумента.Выполнена
		|	И ЗадачаПоОбработкеДокумента.Предмет В(&СписокДокументов)";
		Запрос.УстановитьПараметр("СписокДокументов",Объект.СписокДокументов.Выгрузить(,"Предмет"));
		ЗадачиПоДокументам = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаДокумент Из Объект.СписокДокументов Цикл
			// найдем невыполненные задачи по документу и прервем их
			ЗадачиПоДокументу = ЗадачиПоДокументам.НайтиСтроки(Новый Структура("Документ",СтрокаДокумент.Предмет));
			Для Каждого ЗадачаПоДокументу Из ЗадачиПоДокументу Цикл
				ПроцессыОбработкиДокументов.ВыполнитьЗадачуПользователя(ЗадачаПоДокументу.Ссылка, Истина);
			КонецЦикла;
			
			ТекущийПользователь = Пользователи.ТекущийПользователь();
			ДатаИзмененияСтатуса = ТекущаяДатаСеанса();
			
			ПроцессыОбработкиДокументов.ИзменитьИсториюСтатусовДокумента(СтрокаДокумент.Предмет, Объект.Шаблон,
				Объект.НовыйСтатус, ТекущийПользователь, ДатаИзмененияСтатуса);
			ПроцессыОбработкиДокументов.УстановитьТекущийСтатусДокумента(СтрокаДокумент.Предмет, Объект.Шаблон,
				Объект.НовыйСтатус, ТекущийПользователь, ДатаИзмененияСтатуса);
			
			// для этапа, который запускается, надо удалить признак перехода по нему
			ПроцессыОбработкиДокументов.УстановкаПризнаковПереходаПоЗапускаемомуЭтапу(СтрокаДокумент.Предмет, Объект.Шаблон, Объект.ИдентификаторНовогоЭтапа);
			
			ПараметрыИсполнителя = Новый Структура;
			ПараметрыИсполнителя.Вставить("Исполнитель", Объект.Исполнитель);
			ПараметрыИсполнителя.Вставить("ОсновнойОбъектАдресации", Объект.ОсновнойОбъектАдресации);
			ПараметрыИсполнителя.Вставить("ДополнительныйОбъектАдресации", Объект.ДополнительныйОбъектАдресации);
			ПараметрыИсполнителя.Вставить("ИмяРеквизитаОсновногоОбъектаАдресации", Объект.ИмяРеквизитаОсновногоОбъектаАдресации);
			ПараметрыИсполнителя.Вставить("ИмяРеквизитаДополнительногоОбъектаАдресации", Объект.ИмяРеквизитаДополнительногоОбъектаАдресации);
			
			ПараметрыИсполнителя.Вставить("Этап", Объект.НовыйЭтап);
			ПараметрыИсполнителя.Вставить("ИдентификаторЭтапа", Объект.ИдентификаторНовогоЭтапа);
			ПараметрыИсполнителя.Вставить("ЭтапВыполняетсяНесколькимиИсполнителями", Ложь);
			ПараметрыИсполнителя.Вставить("ОтправлятьПредыдущемуИсполнителюПриПовторномЗапуске", Ложь);
			
			ИсполнителиЭтапа = ПроцессыОбработкиДокументов.ИсполнителиЭтапаПроцесса(СтрокаДокумент.Предмет, Объект.Шаблон, ПараметрыИсполнителя);
			
			// запись следующей задачи
			ПараметрыЗадачи = ПроцессыОбработкиДокументов.ПараметрыСозданияЗадачи();
			ПараметрыЗадачи.Шаблон = Объект.Шаблон;
			ПараметрыЗадачи.Этап = Объект.НовыйЭтап;
			ПараметрыЗадачи.ИдентификаторЭтапа = Объект.ИдентификаторНовогоЭтапа;
			ПараметрыЗадачи.НаименованиеЭтапа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.НовыйЭтап, "Наименование");
			ПараметрыЗадачи.Статус = Объект.НовыйСтатус;
			ПараметрыЗадачи.Документ = СтрокаДокумент.Предмет;
			ПараметрыЗадачи.Описание = Объект.Описание;
			
			ПараметрыЗадачи.РезультатВыполнения = "";
			ПараметрыЗадачи.ПринятаКИсполнению = Ложь;
			// При запуске этапа сервисной обработкой не требуется заполнять предшественников задачи
			ПараметрыЗадачи.Предшественники = Новый Массив;
			
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыЗадачи, ИсполнителиЭтапа[0], Истина);
			
			ПроцессыОбработкиДокументов.СоздатьЗадачу(ПараметрыЗадачи);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
								УровеньЖурналаРегистрации.Ошибка,,,
								ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВыборВидаДокументаПослеПодтвержденияОчисткиТЧ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		
		Объект.СписокДокументов.Очистить();
		Объект.ИдентификаторДокумента = ДополнительныеПараметры;
		
		ПриИзмененииИдентификатораДокумента();
		
	КонецЕсли;
	
КонецПроцедуры

 &НаСервереБезКонтекста
Функция ИмяФормыВыбораДокумента(Знач ИдентификаторДокумента)
	
	ИмяФормыВыбораПоУмолчанию = ".ФормаВыбора";
	ПроцессыОбработкиДокументовПереопределяемый.ПриОпределенииФормыВыбораДляЗапускаЭтапаПроцесса(ИдентификаторДокумента, ИмяФормыВыбораПоУмолчанию);
	
	Возврат ИмяФормыВыбораПоУмолчанию;
	
КонецФункции

#КонецОбласти
